## Quiz #0203

In [2]:
import pandas as pd
import numpy as np
import os

#### Read in the data.

In [3]:
# Go to the directory where the data file is located. 
# os.chdir(r'~~')                # Please, replace the path with your own.

In [4]:
df = pd.read_csv('data_sales.csv', header='infer')

In [5]:
df.shape

(43, 5)

In [6]:
df.head(5)

          Date   Region     Item  UnitPrice  Units
0   4-Jul-2014     East  Pen Set       4.99     62
1  12-Jul-2014     East   Binder       1.99     29
2  21-Jul-2014  Central  Pen Set      12.49     55
3  29-Jul-2014     East   Binder      19.99     81
4   7-Aug-2014  Central  Pen Set      23.95     42

#### Answer the following questions.

1). Append a new variable $Amount = UnitPric \times Units$.

In [7]:
df["Amount"]=df["UnitPrice"]*df["Units"]
df.head()

          Date   Region     Item  UnitPrice  Units   Amount
0   4-Jul-2014     East  Pen Set       4.99     62   309.38
1  12-Jul-2014     East   Binder       1.99     29    57.71
2  21-Jul-2014  Central  Pen Set      12.49     55   686.95
3  29-Jul-2014     East   Binder      19.99     81  1619.19
4   7-Aug-2014  Central  Pen Set      23.95     42  1005.90

2). Average unit price for each region. Use the groupby() method.

In [8]:
region_grp=df.groupby(["Region"])
region_grp["UnitPrice"].mean()

Region
Central    18.018750
East        9.143846
West       53.658333
Name: UnitPrice, dtype: float64

3). Average unit price for each region. Use the pivot_table() method.

In [9]:
df.pivot_table(values="UnitPrice",index="Region",columns=None)

         UnitPrice
Region
Central  18.018750
East      9.143846
West     53.658333

4). Average unit price and units for each region in one code sentence. Use the groupby() method.

In [10]:
df.groupby(by="Region").agg(UnitPrice_mean=("UnitPrice","mean"),Units_mean=("Units","mean"))

         UnitPrice_mean  Units_mean
Region
Central       18.018750   49.958333
East           9.143846   53.153846
West          53.658333   38.500000

5). Average unit price and units for each region in one code sentence. Use the pivot_table() method.

In [11]:
df.pivot_table(values=["UnitPrice","Units"],index="Region",columns=[],aggfunc="mean")

         UnitPrice      Units
Region
Central  18.018750  49.958333
East      9.143846  53.153846
West     53.658333  38.500000

6). Total units for each region and item type in one code sentence. Use the pivot_table() method. Fill the missing values with 0.

In [12]:
df.pivot_table(values="Units",index="Region",columns=["Item"],aggfunc="sum")

Item     Binder  Desk    Pen  Pen Set  Pencil
Region
Central   424.0   7.0   27.0    243.0   498.0
East      234.0   NaN  175.0    152.0   130.0
West       64.0   3.0   76.0      NaN    88.0

In [13]:
df.pivot_table(values="Units",index="Region",columns=["Item"],aggfunc="sum")

Item     Binder  Desk    Pen  Pen Set  Pencil
Region
Central   424.0   7.0   27.0    243.0   498.0
East      234.0   NaN  175.0    152.0   130.0
West       64.0   3.0   76.0      NaN    88.0

7). Total sales amount for each region and item type in one code sentence. Use the pivot_table() method. Fill the missing values with 0.

In [14]:
df.pivot_table(values="Amount",index="Region",columns=["Item"],aggfunc="sum")

Item      Binder   Desk      Pen  Pen Set   Pencil
Region
Central  5762.63  875.0   539.73  2421.39  1540.32
East     2535.66    NaN  1354.25  1748.48   363.70
West     1279.36  825.0   151.24      NaN   231.12

In [15]:
df.pivot_table(values="Amount",index="Region",columns=["Item"],aggfunc="sum").fillna(0,inplace=True)